const DISTRICT_OPTIONS_DATA = {
  "Москва": [
    "unknown",
    "Пресненский",
    "Раменки",
    "Хорошевский",
    "Дорогомилово",
    "Даниловский",
    "Хамовники",
    "Хорошево-Мневники",
    "Арбат",
    "Тверской",
    "Замоскворечье",
    "Обручевский",
    "Можайский",
    "Очаково-Матвеевское",
    "Басманный",
    "Покровское-Стрешнево",
    "Алексеевский",
    "Свиблово",
    "Нагатинский затон",
    "Марфино",
    "Мещанский",
    "Лефортово",
    "Фили-Давыдково"
  ],
  "Санкт-Петербург": [
    "unknown",
    "Петроградский",
    "Василеостровский",
    "Центральный",
    "Московский",
    "Приморский",
    "Невский",
    "Красногвардейский",
    "Выборгский",
    "Адмиралтейский",
    "Калининский",
    "Курортный",
    "Красносельский",
    "Пушкинский",
    "Фрунзенский",
    "Кировский",
    "Петродворцовый"
  ],
  "Казань": [
    "unknown",
    "Советский",
    "Приволжский",
    "Вахитовский",
    "Ново-Савиновский",
    "Кировский",
    "Московский",
    "Авиастроительный"
  ],
  "Нижний Новгород": [
    "unknown",
    "Нижегородский",
    "Автозаводский",
    "Советский",
    "Канавинский",
    "Сормовский",
    "Ленинский",
    "Московский",
    "Приокский"
  ]
} as const;

const UNDERGROUND_OPTIONS_DATA = {
  "Москва": [
    "unknown",
    "Павелецкая",
    "Москва-Сити",
    "Аэропорт",
    "Улица 1905 года",
    "Аминьевская",
    "Шелепиха",
    "Арбатская",
    "Поклонная",
    "Киевская",
    "Воронцовская",
    "Пушкинская",
    "ЦСКА",
    "Давыдково",
    "Потапово",
    "Филатов Луг",
    "Тульская",
    "Останкино",
    "Парк Победы",
    "Кунцевская",
    "Менделеевская",
    "Преображенская площадь",
    "Белорусская",
    "Коммунарка",
    "Петровский Парк",
    "Щёлковская",
    "Калужская",
    "Мичуринский проспект"
  ],
  "Санкт-Петербург": [
    "unknown",
    "Приморская",
    "Комендантский проспект",
    "Спортивная",
    "Крестовский остров",
    "Чернышевская",
    "Василеостровская",
    "Московская",
    "Чкаловская",
    "Юго-Западная",
    "Площадь Александра Невского",
    "Звездная",
    "Горный институт",
    "Лесная",
    "Проспект Просвещения",
    "Новочеркасская",
    "Ломоносовская",
    "Петроградская",
    "Беговая",
    "Московские ворота",
    "Выборгская",
    "Проспект Ветеранов",
    "Балтийская",
    "Купчино",
    "Девяткино",
    "Ладожская",
    "Улица Дыбенко",
    "Гражданский проспект",
    "Садовая",
    "Черная речка",
    "Проспект Большевиков"
  ],
  "Казань": [
    "unknown",
    "Суконная слобода",
    "Площадь Тукая",
    "Авиастроительная",
    "Горки",
    "Яшьлек",
    "Проспект Победы",
    "Кремлёвская",
    "Северный Вокзал",
    "Козья слобода",
    "Дубравная",
    "Аметьево"
  ],
  "Нижний Новгород": [
    "unknown",
    "Горьковская",
    "Буревестник",
    "Парк культуры",
    "Бурнаковская",
    "Стрелка",
    "Ленинская",
    "Заречная",
    "Чкаловская",
    "Пролетарская",
    "Двигатель Революции",
    "Кировская",
    "Московская"
  ]
} as const;

const DISTRICT_TO_UNDERGROUND_RECOMMENDATIONS_DATA = {
  "Москва": {
    "Арбат": [
      "Арбатская"
    ],
    "Даниловский": [
      "Павелецкая",
      "Тульская"
    ],
    "Дорогомилово": [
      "Москва-Сити",
      "Парк Победы",
      "Киевская"
    ],
    "Замоскворечье": [
      "Павелецкая"
    ],
    "Марфино": [
      "Останкино"
    ],
    "Можайский": [
      "Давыдково"
    ],
    "Обручевский": [
      "Воронцовская",
      "Калужская"
    ],
    "Очаково-Матвеевское": [
      "Аминьевская",
      "Давыдково"
    ],
    "Пресненский": [
      "Улица 1905 года",
      "Москва-Сити",
      "Шелепиха"
    ],
    "Раменки": [
      "Аминьевская",
      "Поклонная",
      "Мичуринский проспект"
    ],
    "Тверской": [
      "Менделеевская"
    ],
    "Фили-Давыдково": [
      "Кунцевская"
    ],
    "Хамовники": [
      "Киевская"
    ],
    "Хорошево-Мневники": [
      "Шелепиха"
    ],
    "Хорошевский": [
      "Аэропорт",
      "ЦСКА",
      "Петровский Парк"
    ]
  },
  "Санкт-Петербург": {
    "Адмиралтейский": [
      "Балтийская",
      "Садовая",
      "Василеостровская"
    ],
    "Василеостровский": [
      "Приморская",
      "Василеостровская",
      "Горный институт"
    ],
    "Выборгский": [
      "Проспект Просвещения",
      "Выборгская",
      "Лесная"
    ],
    "Калининский": [
      "Лесная",
      "Гражданский проспект",
      "Выборгская"
    ],
    "Кировский": [
      "Проспект Ветеранов"
    ],
    "Красногвардейский": [
      "Новочеркасская",
      "Девяткино",
      "Ладожская"
    ],
    "Красносельский": [
      "Юго-Западная"
    ],
    "Курортный": [
      "Комендантский проспект",
      "Беговая"
    ],
    "Московский": [
      "Московская",
      "Звездная",
      "Московские ворота"
    ],
    "Невский": [
      "Ломоносовская",
      "Улица Дыбенко",
      "Проспект Большевиков"
    ],
    "Петроградский": [
      "Крестовский остров",
      "Спортивная",
      "Чкаловская"
    ],
    "Петродворцовый": [
      "Юго-Западная"
    ],
    "Приморский": [
      "Комендантский проспект",
      "Беговая",
      "Проспект Просвещения"
    ],
    "Пушкинский": [
      "Купчино",
      "Звездная"
    ],
    "Фрунзенский": [
      "Купчино"
    ],
    "Центральный": [
      "Чернышевская",
      "Площадь Александра Невского"
    ]
  },
  "Казань": {
    "Авиастроительный": [
      "Авиастроительная"
    ],
    "Вахитовский": [
      "Площадь Тукая",
      "Суконная слобода",
      "Кремлёвская"
    ],
    "Кировский": [
      "Яшьлек",
      "Кремлёвская",
      "Авиастроительная"
    ],
    "Московский": [
      "Авиастроительная",
      "Яшьлек",
      "Северный Вокзал"
    ],
    "Ново-Савиновский": [
      "Яшьлек",
      "Козья слобода",
      "Северный Вокзал"
    ],
    "Приволжский": [
      "Проспект Победы",
      "Суконная слобода",
      "Горки"
    ],
    "Советский": [
      "Суконная слобода",
      "Горки",
      "Дубравная"
    ]
  },
  "Нижний Новгород": {
    "Автозаводский": [
      "Парк культуры",
      "Кировская",
      "Пролетарская"
    ],
    "Канавинский": [
      "Стрелка",
      "Бурнаковская",
      "Чкаловская"
    ],
    "Ленинский": [
      "Ленинская",
      "Заречная",
      "Двигатель Революции"
    ],
    "Московский": [
      "Буревестник",
      "Бурнаковская",
      "Стрелка"
    ],
    "Нижегородский": [
      "Горьковская",
      "Московская"
    ],
    "Приокский": [
      "Горьковская",
      "Пролетарская"
    ],
    "Советский": [
      "Горьковская"
    ],
    "Сормовский": [
      "Буревестник"
    ]
  }
} as const;

const UNDERGROUND_TO_DISTRICT_RECOMMENDATIONS_DATA = {
  "Москва": {
    "Аминьевская": [
      "Раменки",
      "Очаково-Матвеевское"
    ],
    "Арбатская": [
      "Арбат"
    ],
    "Аэропорт": [
      "Хорошевский"
    ],
    "Воронцовская": [
      "Обручевский"
    ],
    "Давыдково": [
      "Можайский",
      "Очаково-Матвеевское"
    ],
    "Калужская": [
      "Обручевский"
    ],
    "Киевская": [
      "Хамовники",
      "Дорогомилово"
    ],
    "Кунцевская": [
      "Фили-Давыдково"
    ],
    "Менделеевская": [
      "Тверской"
    ],
    "Мичуринский проспект": [
      "Раменки"
    ],
    "Москва-Сити": [
      "Пресненский",
      "Дорогомилово"
    ],
    "Останкино": [
      "Марфино"
    ],
    "Павелецкая": [
      "Даниловский",
      "Замоскворечье"
    ],
    "Парк Победы": [
      "Дорогомилово"
    ],
    "Петровский Парк": [
      "Хорошевский"
    ],
    "Поклонная": [
      "Раменки",
      "Дорогомилово"
    ],
    "Пушкинская": [
      "Пресненский"
    ],
    "Тульская": [
      "Даниловский"
    ],
    "Улица 1905 года": [
      "Пресненский"
    ],
    "ЦСКА": [
      "Хорошевский"
    ],
    "Шелепиха": [
      "Пресненский",
      "Хорошево-Мневники"
    ]
  },
  "Санкт-Петербург": {
    "Балтийская": [
      "Адмиралтейский"
    ],
    "Беговая": [
      "Приморский",
      "Курортный"
    ],
    "Василеостровская": [
      "Василеостровский",
      "Адмиралтейский"
    ],
    "Выборгская": [
      "Выборгский",
      "Калининский"
    ],
    "Горный институт": [
      "Василеостровский"
    ],
    "Гражданский проспект": [
      "Калининский"
    ],
    "Девяткино": [
      "Красногвардейский"
    ],
    "Звездная": [
      "Московский",
      "Пушкинский"
    ],
    "Комендантский проспект": [
      "Приморский",
      "Курортный"
    ],
    "Крестовский остров": [
      "Петроградский"
    ],
    "Купчино": [
      "Пушкинский",
      "Фрунзенский"
    ],
    "Ладожская": [
      "Красногвардейский"
    ],
    "Лесная": [
      "Калининский",
      "Выборгский"
    ],
    "Ломоносовская": [
      "Невский"
    ],
    "Московская": [
      "Московский"
    ],
    "Московские ворота": [
      "Московский"
    ],
    "Новочеркасская": [
      "Красногвардейский"
    ],
    "Петроградская": [
      "Петроградский"
    ],
    "Площадь Александра Невского": [
      "Центральный"
    ],
    "Приморская": [
      "Василеостровский"
    ],
    "Проспект Большевиков": [
      "Невский"
    ],
    "Проспект Ветеранов": [
      "Кировский"
    ],
    "Проспект Просвещения": [
      "Выборгский",
      "Приморский"
    ],
    "Садовая": [
      "Адмиралтейский"
    ],
    "Спортивная": [
      "Петроградский"
    ],
    "Улица Дыбенко": [
      "Невский"
    ],
    "Черная речка": [
      "Приморский"
    ],
    "Чернышевская": [
      "Центральный"
    ],
    "Чкаловская": [
      "Петроградский"
    ],
    "Юго-Западная": [
      "Красносельский",
      "Петродворцовый"
    ]
  },
  "Казань": {
    "Авиастроительная": [
      "Авиастроительный",
      "Московский",
      "Кировский"
    ],
    "Аметьево": [
      "Советский",
      "Вахитовский",
      "Приволжский"
    ],
    "Горки": [
      "Советский",
      "Приволжский"
    ],
    "Дубравная": [
      "Приволжский",
      "Советский"
    ],
    "Козья слобода": [
      "Ново-Савиновский",
      "Кировский",
      "Московский"
    ],
    "Кремлёвская": [
      "Кировский",
      "Вахитовский"
    ],
    "Площадь Тукая": [
      "Вахитовский",
      "Приволжский"
    ],
    "Проспект Победы": [
      "Приволжский",
      "Советский"
    ],
    "Северный Вокзал": [
      "Ново-Савиновский",
      "Московский",
      "Кировский"
    ],
    "Суконная слобода": [
      "Советский",
      "Вахитовский",
      "Приволжский"
    ],
    "Яшьлек": [
      "Ново-Савиновский",
      "Кировский",
      "Московский"
    ]
  },
  "Нижний Новгород": {
    "Буревестник": [
      "Сормовский",
      "Московский"
    ],
    "Бурнаковская": [
      "Канавинский",
      "Московский"
    ],
    "Горьковская": [
      "Нижегородский",
      "Советский",
      "Приокский"
    ],
    "Двигатель Революции": [
      "Ленинский",
      "Канавинский"
    ],
    "Заречная": [
      "Ленинский"
    ],
    "Кировская": [
      "Автозаводский"
    ],
    "Ленинская": [
      "Ленинский",
      "Канавинский"
    ],
    "Московская": [
      "Канавинский",
      "Нижегородский"
    ],
    "Парк культуры": [
      "Автозаводский"
    ],
    "Пролетарская": [
      "Приокский",
      "Автозаводский"
    ],
    "Стрелка": [
      "Канавинский",
      "Московский"
    ],
    "Чкаловская": [
      "Канавинский"
    ]
  }
} as const;

export {
  DISTRICT_OPTIONS_DATA,
  UNDERGROUND_OPTIONS_DATA,
  DISTRICT_TO_UNDERGROUND_RECOMMENDATIONS_DATA,
  UNDERGROUND_TO_DISTRICT_RECOMMENDATIONS_DATA,
};
